/************************************************************************************
//（店名“众明工作室”）淘宝链接: https://shop149406681.taobao.com/?spm=a1z10.1-c.0.0.64cb457fKzgKea 
//淘宝店内搜索关键词：K_A39_004
//  版 本 号   : v1.0
//  作    者   : 众明工作室
//  交流群 :			 1041406448（其它更多资料请关注公告）
//    CSDN  （基本参数，资源更新列表，所有接线说明）   :单片机代码搬运工(搜索关键词：K_A39_004)
//    BILIBILI（演示视频） :众明工作室(搜索关键词：K_A39_004)
//  生成日期   : 2021-6-21
//  最近修改   : 2021-11-21
//  功能描述   : AT24C02模块测试程序
//  测试条件   : STC89C52RC   晶振11.0592
接线
AT24C02 -------------------------------STC89C52RC
VCC------------------------------------5V
GND------------------------------------GND
SCL------------------------------------P1.3 //
SDA------------------------------------P1.2 //	

OLED0.96(IIC) -------------------------STC89C52RC
VCC------------------------------------5V
GND------------------------------------GND
SCL------------------------------------P1^1
SDA------------------------------------P1^0
*************************************************************************************/

#include "AT24C0X_IIC.h"
#include "delay.h"
/*******************************************************************************
* 函数名         : Delay10us()
* 函数功能		   : 延时10us
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

void Delay10us()
{
	uint8_t a,b;
	for(b=1;b>0;b--)
		for(a=2;a>0;a--);

}
/*******************************************************************************
* 函数名         : I2cStart()
* 函数功能		 : 起始信号：在AT24C0X_SCL时钟信号在高电平期间AT24C0X_SDA信号产生一个下降沿
* 输入           : 无
* 输出         	 : 无
* 备注           : 起始之后AT24C0X_SDA和AT24C0X_SCL都为0
*******************************************************************************/

void I2cStart()
{
	AT24C0X_SDA=1;
	AT24C0X_SCL=1;
	Delay10us();//建立时间是AT24C0X_SDA保持时间>4.7us
	AT24C0X_SDA=0;
	Delay10us();//保持时间是>4us
	AT24C0X_SCL=0;			
	Delay10us();		
}
/*******************************************************************************
* 函数名         : I2cStop()
* 函数功能		 : 终止信号：在AT24C0X_SCL时钟信号高电平期间AT24C0X_SDA信号产生一个上升沿
* 输入           : 无
* 输出         	 : 无
* 备注           : 结束之后保持AT24C0X_SDA和AT24C0X_SCL都为1；表示总线空闲
*******************************************************************************/

void I2cStop()
{
	AT24C0X_SDA=0;
	AT24C0X_SCL=1;
	Delay10us();//建立时间大于4.7us
	AT24C0X_SDA=1;
	Delay10us();	
	
}
/*******************************************************************************
* 函数名         : I2cSendByte(uint8_t dat)
* 函数功能		 : 通过I2C发送一个字节。在AT24C0X_SCL时钟信号高电平期间，保持发送信号AT24C0X_SDA保持稳定
* 输入           : num
* 输出         	 : 0或1。发送成功返回1，发送失败返回0
* 备注           : 发送完一个字节AT24C0X_SCL=0,AT24C0X_SDA=1
*******************************************************************************/

uint8_t I2cSendByte(uint8_t dat)
{
	uint8_t a=0,b=0;//最大255，一个机器周期为1us，最大延时255us。		
	for(a=0;a<8;a++)//要发送8位，从最高位开始
	{
		AT24C0X_SDA=dat>>7;	 //起始信号之后AT24C0X_SCL=0，所以可以直接改变AT24C0X_SDA信号
		dat=dat<<1;
		Delay10us();
		AT24C0X_SCL=1;
		Delay10us();//建立时间>4.7us
		AT24C0X_SCL=0;
		Delay10us();//时间大于4us		
	}
	AT24C0X_SDA=1;
	Delay10us();
	AT24C0X_SCL=1;
	Delay10us();
	while(AT24C0X_SDA)//等待应答，也就是等待从设备把AT24C0X_SDA拉低
	{
		b++;
		if(b>200)	 //如果超过2000us没有应答发送失败，或者为非应答，表示接收结束
		{
			//AT24C0X_SCL=0;
			Delay10us();
			return 0;
		}
	}
	AT24C0X_SCL=0;
	Delay10us();
 	return 1;		
}
/*******************************************************************************
* 函数名         : I2cReadByte()
* 函数功能		   : 使用I2c读取一个字节
* 输入           : 无
* 输出         	 : dat
* 备注           : 接收完一个字节AT24C0X_SCL=0,AT24C0X_SDA=1.
*******************************************************************************/

uint8_t I2cReadByte()
{
	uint8_t a=0,dat=0;
	AT24C0X_SDA=1;			//起始和发送一个字节之后AT24C0X_SCL都是0
	Delay10us();
	for(a=0;a<8;a++)//接收8个字节
	{
		AT24C0X_SCL=0;
		Delay10us();
		AT24C0X_SCL=1;
		Delay10us();
		dat<<=1;
		dat|=AT24C0X_SDA;
		Delay10us();
		AT24C0X_SCL=0;
		Delay10us();
	}
	return dat;		
}


/*******************************************************************************
* 函数名         : void At24c02Write(uint8_t addr,uint8_t dat)
* 函数功能		   : 往24c02的一个地址写入一个数据
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

void At24c02Write(uint8_t addr,uint8_t dat)
{
	I2cStart();
	I2cSendByte(0xa0);//发送写器件地址
	I2cSendByte(addr);//发送要写入内存地址
	I2cSendByte(dat);	//发送数据
	I2cStop();
}
/*******************************************************************************
* 函数名         : uint8_t At24c02Read(uint8_t addr)
* 函数功能		   : 读取24c02的一个地址的一个数据
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/

void At24c02Read( uint8_t *pReadBuf,uint8_t addr,uint8_t usSize)
{
	uint8_t i;
	I2cStart();
	I2cSendByte(0xa0); //发送写器件地址
	I2cSendByte(addr); //发送要读取的地址
	I2cStart();
	I2cSendByte(0xa1); //发送读器件地址
	for (i = 0; i < usSize-1; i++)
	{
		pReadBuf[i]=I2cReadByte(); //读取数据
		 Ack_I2c(0);
	}
	pReadBuf[i]=I2cReadByte(); //读取数据
	Ack_I2c(1);
	I2cStop();
	
}
/********************************************************************
                     应答子函数
函数原型:  void Ack_I2c(bit a);
功能:      主控器进行应答信号(可以是应答或非应答信号，由位参数a决定)
********************************************************************/
void Ack_I2c(bit a)
{
  
  if(a==0)AT24C0X_SDA=0;              /*在此发出应答或非应答信号 */
  else AT24C0X_SDA=1;
  Delay10us();     
  AT24C0X_SCL=1;
  Delay10us(); 
  AT24C0X_SCL=0;                     /*清时钟线，钳住I2C总线以便继续接收*/
  Delay10us();   
}






















